Repository: guruits/healthcare_app
Catalog: health/lib/l10n/app_*.arb
Languages: ta

# appTitle
source: My Health App
ta: என் ஆரோக்கிய அப்பிளிக்கேஷன்

# login
source: Sign In
ta: பயன்பாட்டில் உள்நுழைவு

source: Sign Up
ta: புதிய கணக்கு உருவாக்கு

source: Retake
ta: மீண்டும் எடுக்கவும்

source: Capture Face
ta: முகத்தை பிடிக்கவும்

source: Sign Up
ta: பதிவு செய்க

# register_success
source: Register Successful
ta: பதிவு வெற்றிகரமாக முடிந்தது

source: Phone Number
ta: தொலைபேசி எண்

# continueButton
source: Continue
ta: தொடரவும்

source: Choose User
ta: பயனர் தேர்ந்தெடுக்கவும்

source: User Information
ta: பயனர் தகவல்

source: Aadhar
ta: ஆதார்

source: Full Name
ta: முழு பெயர்

source: DOB
ta: பிறந்த தேதி

source: Address
ta: முகவரி

source: Role
ta: பங்கு

# create_account
source: Do you want to create an account?
ta: ஒரு கணக்கை உருவாக்க விரும்புகிறீர்களா?

source: Helpdesk
ta: உதவி மேஜை

source: Appointments
ta: நியமனங்கள்

source: Vitals
ta: அவசியங்கள்

source: Blood Collection
ta: இரத்த சேகரிப்பு

source: Urine Collection
ta: சிறுநீர் சேகரிப்பு

source: Arc
ta: ஆர்க்

source: Dentist
ta: பல் மருத்துவர்

source: X-ray
ta: எக்ஸ்-ரே

source: DEXA Scan
ta: டெக்சா ஸ்கேன்

source: Echo
ta: எக்கோ

source: Ultrasound
ta: அல்ட்ராசவுண்ட்

source: Awareness
ta: அறிவு

source: Consultation
ta: ஆலோசனை

source: Reports
ta: அறிக்கைகள்

source: Profile
ta: சுயவிவரம்

source: Doctors
ta: மருத்துவர்கள்

source: Employees
ta: ஊழியர்கள்

source: Pharmacy
ta: மருந்தகம்

source: Printer
ta: அச்சுப் பிரிண்டர்

source: Logout
ta: வெளியேறு

# navigating
source: Navigating to
ta: செல்கிறது

source: Available Slots for
ta: கிடைக்கும் நேர இடைகள்

source: Appointment Confirmed
ta: பரிந்துரை உறுதிப்படுத்தப்பட்டது

# appointment_details
source: Appointment on {date} at {slot} for {patient}
ta: {date} அன்று {slot} -இல் உங்கள் பரிந்துரை {patient}க்கானது உறுதிப்படுத்தப்பட்டுள்ளது!

source: OK
ta: சரி

source: Previous Month
ta: முந்தைய மாதம்

source: Next Month
ta: அடுத்த மாதம்

# available_slots
source: Available Slots for {date}
ta: {date} -க்கு கிடைக்கும் இடங்கள்

source: Patients for {slot}:
ta: {slot} -க்கு நோயாளிகள்:

source: Confirm Appointment
ta: பரிந்துரையை உறுதிப்படுத்தவும்

source: View Previous Appointments
ta: முந்தைய பரிந்துரைகளை பார்க்கவும்

source: Full Name
ta: முழு பெயர்

source: Email
ta: மின்னஞ்சல்

source: Phone Number
ta: தொலைபேசி எண்

source: Aadhar Number
ta: ஆதார் எண்

source: Change Password
ta: கடவுச்சொல்லை மாற்று

source: Update Profile
ta: சுயவிவரத்தை புதுப்பிக்கவும்

source: Leave Calendar
ta: விடுப்பு காலண்டர்

# profileUpdated
source: Profile updated successfully!
ta: சுயவிவரம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது!

# diabeticAwarenessTitle
source: Diabetic Awareness
ta: நோயாளி விழிப்புணர்வு

# enterWeight
source: Enter Your Weight (in kg):
ta: உங்கள் எடையை உள்ளிடவும் (கிலோகிராம்):

# dietPlanPrompt
source: Select Diet Plan:
ta: உணவுத் திட்டத்தை தேர்வு செய்க:

# dietPlanVegetarian
source: Vegetarian
ta: சைவம்

# dietPlanNonVegetarian
source: Non-Vegetarian
ta: அசைவம்

source: Generate Diet Plan
ta: உணவுத் திட்டத்தை உருவாக்கவும்

source: Generated Diet Plan:
ta: உருவாக்கிய உணவுத் திட்டம்:

# noDietPlan
source: No diet plan generated.
ta: இதுவரை உணவுத் திட்டம் உருவாக்கப்படவில்லை.

# downloadPDF
source: Download as PDF
ta: PDF ஆக பதிவிறக்கவும்

# invalidWeight
source: Please enter a valid weight.
ta: சரியான எடையை உள்ளிடவும்.

# dietPlanForVegetarian
source: Diet Plan for Vegetarian (Weight: {weight}kg)
ta: சைவ உணவுத் திட்டம் (எடை: {weight}kg)

# dietPlanForNonVegetarian
source: Diet Plan for Non-Vegetarian (Weight: {weight}kg)
ta: அசைவ உணவுத் திட்டம் (எடை: {weight}kg)

source: Breakfast
ta: காலை உணவு

source: Lunch
ta: மதிய உணவு

source: Dinner
ta: இரவு உணவு

source: weight
ta: எடை

source: Diet Plan for
ta: உணவுத் திட்டம்

# vegBreakfast
source: Oatmeal with fruits
ta: பழங்களுடன் ஓட்ஸ்

# vegLunch
source: Quinoa salad with beans
ta: பீன்ஸ் சாலட் கொண்ட கீனோவா

# vegDinner
source: Stir-fried vegetables with tofu
ta: டோஃபு கொண்டு காய்கறி வறுவல்

# nonVegBreakfast
source: Eggs with whole grain toast
ta: கண்கதறி அடியுடன் முட்டைகள்

# nonVegLunch
source: Grilled chicken salad
ta: கிரில் சிக்கன் சாலட்

# nonVegDinner
source: Fish with steamed vegetables
ta: ஆளும் காய்கறியுடன் மீன்

# dietPlanGeneratedMessage
source: Diet plan PDF generated!
ta: உணவுத் திட்ட PDF உருவாக்கப்பட்டது!

source: Existing Patient
ta: இருக்கும் நோயாளி

source: New Patient
ta: புதிய நோயாளி

source: Enter Phone Number
ta: தொலைபேசி எண்ணை உள்ளிடவும்

source: Add User
ta: பயனரை சேர்க்கவும்

source: Book Appointment
ta: அப்பாயின்மெண்ட் பதிவு

source: Name
ta: பெயர்

# scan_aadhar_qr
source: Scan Aadhar QR Code
ta: ஆதார் QR குறியீட்டை ஸ்கேன் செய்யவும்

# scan_aadhar_front_back
source: Scan Aadhar Card (Front & Back)
ta: ஆதார் அட்டை (முன் & பின்புறம்) ஸ்கேன் செய்யவும்

source: Scan QR Code
ta: QR குறியீட்டை ஸ்கேன் செய்யவும்

# scan_aadhar_front
source: Scan Front
ta: முன் பக்கம் ஸ்கேன் செய்யவும்

# scan_aadhar_back
source: Scan Back
ta: பின்புறம் ஸ்கேன் செய்யவும்

# preview_scanned_images
source: Preview of Scanned Images:
ta: ஸ்கேன் செய்யப்பட்ட படங்கள் முன்னோட்டம்:

source: Aadhar Number
ta: ஆதார் எண்

source: Set Password
ta: கடவுச்சொல்லை அமைக்கவும்

source: New Password
ta: புதிய கடவுச்சொல்

source: Confirm Password
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

source: Submit
ta: சமர்ப்பி

# title
source: Blood Collection
ta: இரத்த சேகரிப்பு

source: Select Patient
ta: நோயாளியைத் தேர்ந்தெடுக்கவும்

source: Patient Name
ta: நோயாளியின் பெயர்

source: Mobile Number
ta: மொபைல் எண்

source: Appointment Slot
ta: அப்பாயின்ட் முறை

source: Collection Number
ta: சேகரிப்பு எண்

source: Print Label
ta: லேபிள் அச்சிடு

# selected_patient_info
source: Selected Patient Information
ta: தேர்ந்தெடுக்கப்பட்ட நோயாளியின் தகவல்

# blood_appointment_success
source: Blood collection appointment number generated successfully.
ta: இரத்த சேகரிப்பு நேரடி எண் வெற்றிகரமாக உருவாக்கப்பட்டது.

# back_button
source: Back
ta: முந்தைய பக்கம்

# title_consultation
source: Consultation
ta: ஆலோசனை

source: Select Doctor
ta: டாக்டரைத் தேர்ந்தெடுக்கவும்

source: Patient Report Summary
ta: நோயாளர் அறிக்கை சுருக்கம்

source: Age
ta: வயது

source: Alcoholic
ta: மதுபானம் குடிக்கிறாரா

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: Drinking Age
ta: மதுபானம் குடிக்கும் வயது

source: Smoking
ta: புகைபிடிக்கிறாரா

source: Smoking Age
ta: புகைபிடிக்கும் வயது

source: Family History
ta: குடும்ப வரலாறு

source: Medical History
ta: மருத்துவ வரலாறு

source: Enter Prescription
ta: மருந்துச் செயலியை உள்ளிடவும்

# tablets_injections
source: Tablets / Injections (and duration)
ta: மருந்துகள் / ஊசிகள் (கால அளவு)

source: Next Visit Date
ta: அடுத்த சந்திப்பு தேதி

# select_date
source: Select a date
ta: ஒரு தேதியைத் தேர்ந்தெடுக்கவும்

source: Doctor Signature
ta: மருத்துவர் கையொப்பம்

source: Clear Signature
ta: கையொப்பத்தை அழிக்கவும்

source: Generate Prescription
ta: மருந்துச் செயலை உருவாக்கவும்

source: {relation} has {condition}
ta: {relation} க்கு {condition}

source: Select Test
ta: சோதனையைத் தேர்ந்தெடுக்கவும்

# selected_patient
source: Selected patient {patientName}
ta: தேர்ந்தெடுக்கப்பட்ட நோயாளி {patientName}

source: Select Status
ta: நிலையைத் தேர்ந்தெடுக்கவும்

source: Clear Filter
ta: வடிகட்டலை அகற்றவும்

# blood_test_label
source: Blood Test
ta: இரத்த பரிசோதனை

# urine_test_label
source: Urine Test
ta: சிறுநீர் சோதனை

# arc_test_label
source: ARC Test
ta: ஏஆர்சி பரிசோதனை

# dentist_test_label
source: Dentist Test
ta: பல் மருத்துவர் பரிசோதனை

# xray_label
source: X-ray
ta: எக்ஸ்-கிரே

# dexa_scan_label
source: Dexa Scan
ta: டெக்ஸா ஸ்கேன்

# echo_test_label
source: Echo Test
ta: எக்கோ பரிசோதனை

# ultrasound_label
source: Ultrasound
ta: உள்ளமைவு ஒலிச் சோதனை

# consultation_label
source: Consultation
ta: ஆலோசனை

source: Page
ta: பக்கம்

# status_in_progress
source: In Progress
ta: நடந்து கொண்டிருக்கும்

# status_completed
source: Completed
ta: பூர்த்தி செய்யப்பட்டது

# status_yet_to_start
source: Yet to Start
ta: தொடங்கவில்லை

source: Eye Arc Test
ta: கண் வில்ல்வை பரிசோதனை

source: Generated Arc Test Number
ta: உருவாக்கப்பட்ட வில்ல்வை பரிசோதனை எண்

# appointment_date_time
source: Appointment Date and Time
ta: நியமன தேதி மற்றும் நேரம்

source: Pick Date & Time
ta: தேதி மற்றும் நேரத்தைத் தேர்ந்தெடுக்கவும்

# date_time_label
source: Date & Time
ta: தேதி & நேரம்

source: Dentist Appointment
ta: பல் மருத்துவர் சந்திப்பு

source: Generated Dentist Appointment Number
ta: உருவாக்கப்பட்ட பல் மருத்துவர் நியமன எண்

source: Dexa Scan Appointment
ta: டெக்ஸா ஸ்கேன் சந்திப்பு

source: Generated Dexa Scan Appointment Number
ta: உருவாக்கப்பட்ட டெக்ஸா ஸ்கேன் நியமன எண்

source: Urine Collection
ta: சிறுநீர் சோதனை

source: Generated Urine Collection Number
ta: உருவாக்கப்பட்ட மூத்திரம் சேகரிப்பு எண்

source: X-Ray Appointment
ta: எக்ஸ்-ரே நேரம்

source: Generated X-Ray Appointment Number
ta: உருவாக்கப்பட்ட எக்ஸ்-ரே நேரம் எண்

source: Echo Appointment
ta: எக்கோ நியமனம்

source: Generated Echo Appointment Number
ta: உருவாக்கப்பட்ட எக்கோ நியமன எண்

source: Ultrasound Appointment
ta: அல்ட்ராசவுண்ட் நியமனம்

source: Generated Ultrasound Appointment Number
ta: உருவாக்கப்பட்ட அல்ட்ராசவுண்ட் நியமன எண்

source: Cancel
ta: ரத்து செய்யவும்

source: Quantity:
ta: அளவு

source: Doctors List
ta: மருத்துவர்கள் பட்டியல்

source: Specialization
ta: மருத்துவ நிபுணத்துவம்

source: Availability
ta: பணியில் இருக்கும் நேரம்

source: Next Leave
ta: அடுத்த விடுப்பு

source: Mobile
ta: மொபைல்

source: Employees List
ta: ஊழியர்கள் பட்டியல்

source: Job Title
ta: வேலைப் பொறுப்பு

source: Call
ta: அழைப்பு

source: Send Email
ta: மின்னஞ்சல் அனுப்பவும்

# blutooth_vitals
source: Bluetooth Native
ta: நேடிவ் புளூடூத்

source: Back
ta: திரும்பு

source: Connect to Devices
ta: சாதனங்களுடன் இணை

source: Discover Devices
ta: சாதனங்களை கண்டறி

source: All Paired Devices
ta: இணைக்கப்பட்ட அனைத்து சாதனங்கள்

source: Available Devices
ta: கிடைக்கும் சாதனங்கள்

source: Connected Devices
ta: இணைக்கப்பட்ட சாதனங்கள்

source: Previously Connected Devices
ta: முந்தைய இணைக்கப்பட்ட சாதனங்கள்

# languageToggle
source: Language
ta: மொழி

source: Blood Test
ta: இரத்த பரிசோதனை

source: Urine Test
ta: மூத்திர பரிசோதனை

source: Drug Prescription
ta: மருந்து மருந்தளவு

source: Eye Arc Test
ta: கண் வளைவு பரிசோதனை

source: Dental Report
ta: பல் அறிக்கை

source: Echo Test
ta: எக்கோ பரிசோதனை

source: Ultrasound Test
ta: உடல்நோக்கு பரிசோதனை

source: Diet Plan
ta: உணவுக்கட்டளை

source: Select Report Category
ta: அறிக்கை வகையை தேர்வு செய்யவும்

source: Preview
ta: காண்பி

source: Print
ta: அச்சிடுக

source: Language changed
ta: மொழி மாற்றப்பட்டது

source: Printer not connected
ta: பிரிண்டர் இணைக்கப்படவில்லை

# connectToPrinter
source: Please connect to the selected printer.
ta: தயவுசெய்து தேர்ந்தெடுக்கப்பட்ட பிரிண்டரை இணைக்கவும்.

# printProgress
source: Printing...
ta: அச்சிடுதல்...

source: Print Complete
ta: அச்சிடல் முடிந்தது

source: Report not found!
ta: அறிக்கை காணப்படவில்லை!

# reportCategoryA
source: Category A
ta: வகை A

# reportCategoryB
source: Category B
ta: வகை B

# reportCategoryC
source: Category C
ta: வகை C

# printerSelection
source: Select Printer
ta: பிரிண்டரை தேர்வு செய்யவும்

# choosePrinter
source: Choose a Printer
ta: பிரிண்டரை தேர்வு செய்யவும்

source: Loading...
ta: ஊட்டுவிதை

# printError
source: An error occurred while printing.
ta: அச்சிடுவதில் பிழை ஏற்பட்டுள்ளது.

source: Retry
ta: மறுமொழி முயற்சிக்கவும்

# printSuccess
source: Report has been sent to the printer.
ta: அறிக்கை பிரிண்டருக்கு அனுப்பப்பட்டுள்ளது.

# confirmation
source: Are you sure you want to proceed?
ta: நீங்கள் தொடர விரும்புகிறீர்களா?

# noData
source: No data available
ta: தரவு இல்லை

# errorOccurred
source: An error occurred. Please try again.
ta: பிழை ஏற்பட்டுள்ளது. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.
